cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

### packages for work and personal use
brew "bash"
brew "deno" # macOS-only - Secure runtime for JavaScript and TypeScript
brew "gh" # GitHub command-line tool
brew "git"# Distributed revision control system
# brew "gnupg"
brew "gnu-sed"
brew "grep"
brew "curl" # Get a file from an HTTP, HTTPS or FTP server
brew "mas" # macOS-only
brew 'nginx'# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "pinentry" # Passphrase entry dialog utilizing the Assuan protocol
brew "pipx" # Execute binaries from Python packages in isolated environments
brew "python" # Pretty-print tabular data in Python
brew "aria2" # Download with resuming and segmented downloading
brew "shfmt" # Autoformat shell script source code
brew "webp" # Image format providing lossless and lossy compression for web images
brew "zsh" # UNIX shell
brew "zsh-completions" # Additional completion definitions for zsh
brew "zsh-syntax-highlighting" # Fish shell like syntax highlighting for zsh
brew 'tree' # Display directories as trees (with optional color/HTML output)
brew 'wget' # Internet file retriever
brew 'yarn' # JavaScript package manager
brew 'mackup' # Keep your Mac's application settings in sync
brew 'hub' # Add GitHub support to git on the command-line

# Media
brew 'jpegoptim' # Utility to optimize JPEG files
brew 'optipng' # PNG file optimizer
brew 'pngquant' # PNG image optimizing utility
brew 'svgo' # Nodejs-based tool for optimizing SVG vector graphics files
brew 'gifsicle' # GIF image/animation creator/editor
brew "ffmpeg" # Play, record, convert, and stream audio and video
brew "media-info" # Unified display of technical and tag data for audio/video
brew "mp4v2" # Read, create, and modify MP4 files

# Casks for work and personal use
cask "visual-studio-code" # Fully naative from 1.54 ✅
cask "vlc" # Fully naative from 1.54 ✅
cask "app-cleaner" # AppCleaner full native  ✅
cask "bettertouchtool" # Zoom BTT fully supported from version 3.502 ✅
cask "firefox" # Firefox fully native ✅
cask "firefox-developer-edition" # Firefox fully native ✅
cask "iterm2" # Iterm fully supported from 3.4.0 ✅
cask "karabiner-elements" # karabiner full native ✅
cask "google-chrome" # Chrome fully supported from version 87 ✅
cask "google-chrome-dev" # Chrome fully supported from version 87 ✅
cask "notion" # Notion fully native ✅
cask "rectangle" # Rectangle full native ✅
cask "slack" # Slack fully native from 4.13.0 ✅
cask "tower" # Full native support from 6 ✅
cask "typora" # Fully supported from version 0.9.9.36 ✅
cask "vlc" # vlc full native from 3.0.12 ✅
cask "iterm2" # Fully naative from 3.4.0 ✅
cask "1password" # full native Apple Silicon support as of 7.8 ✅
cask "brave-browser" # Full Native Apple Silicon Support ✅
cask "bootstrap-studio" # Compatibility through Rosetta2 🌹
cask "calibre" # Compatibility through Rosetta2 🌹
cask "discord" # Compatibility through Rosetta2 🌹
cask "idrive" # Compatibility through Rosetta2 🌹
cask "github" # Compatibility through Rosetta2 🌹
cask "nordvpn" # Compatibility through Rosetta2 🌹
cask "spotify" # Compatibility through Rosetta2 🌹
cask "transmission" # Compatibility through Rosetta2 🌹
cask "whatsapp" # Compatibility through Rosetta2 🌹
cask "zoom" # Compatibility through Rosetta2 🌹
cask "keybase" # Compatibility through Rosetta2 🌹

# Alfred fully supported ✅
# Dash fully supported from version 6 ✅
# Things fully supported from version 3.13.2fully supported from version ✅
# Focus via rosetta 🌹
# cask "responsively"
# cask "malwarebytes"


### mac app store
# mas install 409183694 # "keynote"
# mas install 409203825 # "numbers"
# mas install 40920154 # "pages"