cask_args appdir: "/Applications"
tap "buo/cask-upgrade" # brew cu

brew "aria2"
brew "curl"
brew "dialog"
brew "exiftool"
brew "ffmpeg"
brew "gh"
brew "pinentry"
brew "gnupg"
brew "mas"
brew "media-info"
brew "mp4v2"
brew "php", restart_service: :changed
brew "python@3.13"
brew "pipx"
brew "pnpm"
brew "postgresql@14"
brew "pyenv"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh-syntax-highlighting"

cask "alfred"
cask "amazon-q"
cask "brave-browser"
cask "docker-desktop"
cask "expressvpn"
cask "gitkraken"
cask "handbrake-app"
cask "monitorcontrol"
cask "postico"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
mas "Amphetamine", id: 937984704
mas "Peek", id: 1554235898
mas "Perplexity", id: 6714467650
