cask_args appdir: "/Applications"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"


brew "aria2" # Download with resuming and segmented downloading
brew "curl" # Command-line tool for transferring data with URLs
brew "exiftool" # Application for reading, writing and editing meta information
brew "ffmpeg" # Play, record, convert, and stream audio and video
brew "gh" # GitHub command-line tool
brew "gnupg" # GNU Privacy Guard - encrypt and sign data and communications
brew "mas" # Mac App Store command-line interface
brew "media-info" # Unified display of technical and tag data for audio/video
brew "mp4v2" # Read, create, and modify MP4 files
brew "php", restart_service: true
brew "pinentry" # Passphrase entry dialog utilizing the Assuan protocol
brew "pipx" # Execute binaries from Python packages in isolated environments
brew "pyenv" # Python version management tool
brew "python@3.13" # Python 3.13 programming language
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "wget" # Internet file retriever
brew "yarn" # JavaScript package manager

cask "alfred" # Productivity app for macOS
cask "amazon-q" # AI-powered coding assistant
cask "brave-browser" # Privacy-focused web browser
cask "docker" # Platform for developing, shipping, and running applications
cask "expressvpn" # VPN service for privacy and security
cask "gitkraken" # Git GUI client
cask "handbrake" # Video transcoder
cask "monitorcontrol" # Control external monitor brightness and volume
cask "postico" # PostgreSQL client for macOS
cask "slack" # Team communication and collaboration platform
cask "spotify" # Music streaming service
cask "visual-studio-code" # Source code editor
cask "vlc" # Media player for various audio and video formats

mas "Amphetamine", id: 937984704
mas "Peek", id: 1554235898
